---
kind: property
id: P:Autodesk.Revit.DB.Events.CreateRelatedFileProgressChangedEventArgs.DownloadFinished
source: html/3c4bca7d-e030-22e2-cb4b-634dcb9a30f9.htm
---
# Autodesk.Revit.DB.Events.CreateRelatedFileProgressChangedEventArgs.DownloadFinished Property

Indicates if all data downloads are finished.

## Syntax (C#)
```csharp
public bool DownloadFinished { get; }
```